[
    {
      "text": "Пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете",
      "author": "Мартин Голдинг"
    },
    {
      "text": "Сложность программы растет до тех пор, пока не превысит способности программиста",
      "author": "Артур Блох. Законы Мэрфи"
    },
      {
      "text": "Ходить по воде и разрабатывать программы, следуя ТЗ, очень просто… если они заморожены",
      "author": "Эдуард В. Берард"
    },
    {
        "text": "Программирование сегодня — это гонка разработчиков программ, стремящихся писать программы с большей и лучшей идиотоустойчивостью, и вселенной, которая пытается создать больше отборных идиотов. Пока вселенная побеждает.",
        "author": "Рик Кук"
    },
    {
        "text": "Я всегда мечтал о том, чтобы моим компьютером можно было пользоваться так же легко, как телефоном; моя мечта сбылась: я уже не могу разобраться, как пользоваться моим телефоном.",
        "author": "Бьёрн Страуструп"
    },
    {
        "text": "Обучение программированию не может научить быть экспертом, также как и изучение кистей и красок не может превратить кого-либо в художника.",
        "author": "Эрик Стивен Реймонд"
    },
    {
        "text": "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили.",
        "author": "Mosher’s Law of Software Engineering"
    },
    {
        "text": "Для меня долгое время было загадкой, как что-то очень дорогое и технологичное может быть столь бесполезным. И вскоре я осознал, что компьютер — это глупая машина, обладающая способностями выполнять невероятно умные вещи, тогда как программисты — это умные люди, у которых талант делать невероятные глупости. Короче, они нашли друг друга.",
        "author": "Билл Брайсон"
    },
    {
        "text": "Когда кто-то говорит: «Я хочу язык программирования, который может делать все, что ему скажу», то я даю этому человеку леденец.",
        "author": "Алан Джей Перлис "
    },
    {
        "text": "Болтовня ничего не стоит. Покажите мне код.",
        "author": "Линус Торвальдс"
    },
    {
        "text": "Как видно, совершенство достигается не тогда, когда уже нечего прибавить, но когда уже ничего нельзя отнять.",
        "author": "Антуан де Сент-Экзюпери"
    },
    {
        "text": "Вы не можете создавать хорошие программы без хорошей команды, но большинство софтверных команд ведут себя как проблемная семья.",
        "author": "Джим Маккарти"
    },
    {
        "text": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю отлаживая написанный в понедельник код.",
        "author": "Кристофер Томпсон"
    },
    {
        "text": "Измерять продуктивность программирования подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
        "author": "Билл Гейтс"
    },
    {
        "text": "Люди считают, что программирование — это наука избранных, но в реальности все наоборот — просто много людей создают программы, которые используют чужие программы, как-будто строя стену из маленьких кирпичиков.",
        "author": "Дональд Кнут"
    },
    {
        "text": "Сначала учите науку программирования и всю теорию. Далее выработаете свой программистский стиль. Затем забудьте все и просто программируйте.",
        "author": "Джордж Карретт"
    },
    {
        "text": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня.",
        "author": "Ларри Уолл"
    },
    {
        "text": "Если оптимизировать всё, что можно, то вы будете вечно несчастным.",
        "author": "Дональд Кнут"
    },
    {
        "text": "Трудность работы с програмистом заключается в том, что вы не можете понять что он делает до тех пор пока не стало слишком поздно.",
        "author": "Сеймур Крэй"
    },
    {
        "text": "Помните, что обычно есть решение проще и быстрее того, что первым приходит вам в голову.",
        "author": "Дональд Кнут"
    },
    {
        "text": "Есть два способа создания дизайна программы. Один из них, это сделать его настолько простым, что в нем, очевидно, не будет недостатков. Другой способ — сделать его настолько запутанным, что в нем не будет очевидных недостатков.",
        "author": "Чарльз Хоар"
    },
    {
        "text": "Модульность — фундаментальный аспект всех успешно работающих крупных систем.",
        "author": "Бьёрн Страуструп"
    },
    {
        "text": "Программа, которая не тестировалась, не является рабочей.",
        "author": "Бьёрн Страуструп"
    },
    {
        "text": "Программирование — это не наука, а ремесло.",
        "author": "Ричард Столлман"
    },
    {
        "text": "Лень — главное достоинство программиста.",
        "author": "Ларри Уолл"
    },
    {
        "text": "Лень — естественное состояние программиста, после которого он рождает хороший алгоритм.",
        "author": "Народное творчество"
    }
  ]  